/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   helpers.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: wscallop <wscallop@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/30 15:16:39 by wscallop          #+#    #+#             */
/*   Updated: 2020/11/30 21:36:01 by wscallop         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "lem.h"

/*
**		Функция, определяющая является ли символ пробелом, табуляция или другим
**		символом "пустого" пространства
*/

int		ft_isspace(int c)
{
	unsigned char ch;

	ch = (unsigned char)c;
	if ((ch >= '\t' && ch <= '\r') || ch == ' ')
		return (1);
	return (0);
}
